functionProcessor/testCase/0/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
277632
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform -1;
    }
    outlet
    {
        type            calculated;
        value           uniform -1;
    }
    wall
    {
        type            calculated;
        value           uniform -1;
    }
}


// ************************************************************************* //
